In [1]:
import pandas as pd
dataframe = pd.read_csv('./daily-total-female-births-CA.csv', header=0)

In [2]:
dataframe.head()

         date  births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [5]:
dataframe['date'].dtype

dtype('O')

### DateTime issue

need to take this as dates

In [8]:
df2 = pd.read_csv('./daily-total-female-births-CA.csv', header=0, parse_dates=[0])

in most cases pandas automatically identifies date time format. If it is not able to do it you need to use an extra , dateparse param in above after defining it

In [10]:
df2['date'].dtype

dtype('<M8[ns]')

### Load data as series

In [12]:
series = pd.read_csv('./daily-total-female-births-CA.csv', header=0, parse_dates=[0], index_col=0).squeeze("columns")

In [13]:
series.head()

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
Name: births, dtype: int64

In [14]:
series.shape

(365,)

In [15]:
df2.shape

(365, 2)

Query for series

In [16]:
print(series['1959-01'])

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
1959-01-06    29
1959-01-07    45
1959-01-08    43
1959-01-09    38
1959-01-10    27
1959-01-11    38
1959-01-12    33
1959-01-13    55
1959-01-14    47
1959-01-15    45
1959-01-16    37
1959-01-17    50
1959-01-18    43
1959-01-19    41
1959-01-20    52
1959-01-21    34
1959-01-22    53
1959-01-23    39
1959-01-24    32
1959-01-25    37
1959-01-26    43
1959-01-27    39
1959-01-28    35
1959-01-29    44
1959-01-30    38
1959-01-31    24
Name: births, dtype: int64

In [17]:
df2[(df2['date']>='1959-01-01') & (df2['date']<='1959-01-10')]

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44
5 1959-01-06      29
6 1959-01-07      45
7 1959-01-08      43
8 1959-01-09      38
9 1959-01-10      27

descriptions

In [18]:
series.describe()

count    365.000000
mean      41.980822
std        7.348257
min       23.000000
25%       37.000000
50%       42.000000
75%       46.000000
max       73.000000
Name: births, dtype: float64

In [19]:
df2.describe()

           births
count  365.000000
mean    41.980822
std      7.348257
min     23.000000
25%     37.000000
50%     42.000000
75%     46.000000
max     73.000000

### Visualise time series